deliverables/iteration2/Iteration2Final/app/controllers/forum_controller.rb

SELECT  "forums".* FROM "forums" WHERE "forums"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def view_forum
      require_user
      if !params[:id].nil?
        id = Integer(params[:id])
        @forum = Forum.find(id) #