app/controllers/forum_controller.rb

    def view_forum
      if !params[:id].nil?
        id = Integer(params[:id])
        @forum = Forum.find(id) #
---
SELECT  "forums".* FROM "forums" WHERE "forums"."forum_id" = ? LIMIT ?  [["forum_id", 2], ["LIMIT", 1]]