app/controllers/qa_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."question_id" = ? LIMIT ?  [["question_id", 2], ["LIMIT", 1]]
---
  def view_question
    if (!params[:id].nil?)
      id = Integer(params[:id])
      @question = Question.find(id) # return the question object

INSERT INTO "questions" ("question_title", "question_description", "user_id", "forum_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["question_title", "Test"], ["question_description", "test"], ["user_id", 1], ["forum_id", 4], ["created_at", 2017-03-14 02:44:02 UTC], ["updated_at", 2017-03-14 02:44:02 UTC]]
---
  def post_question
    if request.post?
      @question = Question.new(question_params)

      if @question.save

INSERT INTO "answers" ("answer", "user_id", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["answer", "Test"], ["user_id", 1], ["question_id", 7], ["created_at", 2017-03-14 03:52:08 UTC], ["updated_at", 2017-03-14 03:52:08 UTC]]
SELECT  "questions".* FROM "questions" WHERE "questions"."question_id" = ? LIMIT ?  [["question_id", 9], ["LIMIT", 1]]
---
  def answer_question
    if request.post?
      @answer = Answer.new(answer_params)
      if @answer.save
        redirect_to controller:"qa", action:"view_question", id:@answer.question_id
      else
         @question = Question.find(@answer.question_id)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit_question
    #require_admin
    if request.post? # pass in the entire object you want to edit
      #over-write the data of the existing question
      #title, text, etc.
      #lookup the existing object in the db, edit the values, and save it.
      @question = Question.find(edit_question_params.id) #inbound data object with the 3 params