app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "crypted_password", "password_salt", "email", "persistence_token", "single_access_token", "perishable_token", "login_count", "last_request_at", "current_login_at", "current_login_ip", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    @user = User.new(user_params)
    # Saving without session maintenance to skip
    # auto-login which can't happen here because
    # the User has not yet been activated
    if @user.save